ws_1c_edt/ws_admin/src/DataProcessors/ЗагрузкаНачальныхДанных/ЗагрузкаНачальныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаНачальныхДанных</name>
  <attributes>
    <name>АдресВебСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ws_1c_edt/ws_admin/src/Catalogs/УчетныеЗаписиПользователей/УчетныеЗаписиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиПользователей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ws_1c_edt/ws_admin/src/DataProcessors/ЗагрузкаНачальныхДанных/Forms/Форма/Module.bsl
&НаКлиенте
Асинх Процедура ВыполнитьЗагрузку(Команда)
	#Если НЕ ВебКлиент Тогда
	Результат = Ждать ВопросАсинх("Выполнить начальную загрузку данных?", РежимДиалогаВопрос.ОКОтмена);
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗагрузкуНаСервере();
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	
	ОчиститьСправочники();
	
//	Если ping(Объект.АдресВебСервиса) <> "ok" Тогда
//		Сообщить("Нет связи!", СтатусСообщения.Важное);
//		Возврат;
//	КонецЕсли; 
	
	ОписаниеОшибки = "";
	Соединение = ПолучитьСоединениеTrade(Объект.АдресВебСервиса, Пользователь, Пароль, ОписаниеОшибки);
	Если ОписаниеОшибки <> "" ТОгда
		Сообщить(ОписаниеОшибки, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.ЭтоГруппа КАК ЭтоГруппа,
	|	Пользователи.Родитель КАК Родитель,
	|	Пользователи.Код КАК Код,
	|	Пользователи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ,
	|	Родитель
	|";
	
	ПараметрыЗапроса = Новый Структура();	
	ПараметрыЗапроса.Вставить("ПреобразоватьЗначенияВXML", Истина);
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Запись, ПараметрыЗапроса);
	xmlParam = Запись.Закрыть();
	
	ОтветСервера = Соединение.getRequestRulsult(ТекстЗапроса, xmlParam, 0);

	Если ТипЗнч(ОтветСервера) = Тип("ДвоичныеДанные") ТОгда
		ИмяФайла 		= ПолучитьИмяВременногоФайла("xml");
		ОтветСервера.Записать(ИмяФайла);
		Чтение 			= Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ИмяФайла);
		Результат 		= СериализаторXDTO.ПрочитатьXML(Чтение, Тип("ТаблицаЗначений"));
		
		Для Каждого ТекСтрока Из Результат Цикл

			Если ТекСтрока.ЭтоГруппа Тогда
				НовыйЭлемент = Справочники.Пользователи.СоздатьГруппу();			
			Иначе
				НовыйЭлемент = Справочники.Пользователи.СоздатьЭлемент();
			КонецЕсли;
			ТекЭлемент = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока.Ссылка));
			
			Если ТекЭлемент.ПолучитьОбъект() <> Неопределено Тогда
				ВызватьИсключение "Объект уже существует!";
			КонецЕсли;
			НовыйЭлемент.УстановитьСсылкуНового(ТекЭлемент);
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ТекСтрока,, "ЭтоГруппа,Родитель,Ссылка");
			Если СокрЛП(ТекСтрока.Родитель) <> "" ТОгда
				НовыйЭлемент.Родитель = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока.Родитель));
			КонецЕсли;
			НовыйЭлемент.Записать();
		КонецЦикла;

	КонецЕсли;

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	УчетныеЗаписиПользователей.Ссылка КАК Ссылка,
	|	УчетныеЗаписиПользователей.ЭтоГруппа КАК ЭтоГруппа,
	|	УчетныеЗаписиПользователей.Родитель КАК Родитель,
	|	УчетныеЗаписиПользователей.Код КАК Код,
	|	УчетныеЗаписиПользователей.Наименование КАК Наименование,
	|	УчетныеЗаписиПользователей.Пароль КАК Пароль,
	|	УчетныеЗаписиПользователей.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.УчетныеЗаписиПользователей КАК УчетныеЗаписиПользователей
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ,
	|	Родитель
	|";;
	
	ПараметрыЗапроса = Новый Структура();	
	ПараметрыЗапроса.Вставить("ПреобразоватьЗначенияВXML", Истина);
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Запись, ПараметрыЗапроса);
	xmlParam = Запись.Закрыть();
	
	ОтветСервера = Соединение.getRequestRulsult(ТекстЗапроса, xmlParam, 0);

	Если ТипЗнч(ОтветСервера) = Тип("ДвоичныеДанные") ТОгда
		ИмяФайла 		= ПолучитьИмяВременногоФайла("xml");
		ОтветСервера.Записать(ИмяФайла);
		Чтение 			= Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ИмяФайла);
		Результат 		= СериализаторXDTO.ПрочитатьXML(Чтение, Тип("ТаблицаЗначений"));
		
		Для Каждого ТекСтрока Из Результат Цикл

			Если ТекСтрока.ЭтоГруппа Тогда
				НовыйЭлемент = Справочники.УчетныеЗаписиПользователей.СоздатьГруппу();	
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, ТекСтрока,, "ЭтоГруппа,Родитель,Ссылка,Пользователь,Пароль");		
			Иначе
				НовыйЭлемент = Справочники.УчетныеЗаписиПользователей.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, ТекСтрока,, "ЭтоГруппа,Родитель,Ссылка,Пользователь");
			КонецЕсли;
			ТекЭлемент = Справочники.УчетныеЗаписиПользователей.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока.Ссылка));
			
			Если ТекЭлемент.ПолучитьОбъект() <> Неопределено Тогда
				ВызватьИсключение "Объект уже существует!";
			КонецЕсли;
			
			НовыйЭлемент.УстановитьСсылкуНового(ТекЭлемент);
			
			Если СокрЛП(ТекСтрока.Родитель) <> "" ТОгда
				НовыйЭлемент.Родитель = Справочники.УчетныеЗаписиПользователей.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока.Родитель));
			КонецЕсли;
			Если СокрЛП(ТекСтрока.Пользователь) <> "" ТОгда
				НовыйЭлемент.Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСтрока.Пользователь));
			КонецЕсли;
			НовыйЭлемент.УстановитьНовыйКод();
			НовыйЭлемент.Записать();
		КонецЦикла;

	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСправочники()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетныеЗаписиПользователей.Ссылка
		|ИЗ
		|	Справочник.УчетныеЗаписиПользователей КАК УчетныеЗаписиПользователей";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ТекОбъект <> Неопределено Тогда
			ТекОбъект.Удалить();
		КонецЕсли;
	КонецЦикла;
	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ТекОбъект <> Неопределено Тогда
			ТекОбъект.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоединениеTrade(Хост = Неопределено, _Пользователь = Неопределено, ПарольПользователя = Неопределено, ОписаниеОшибки = Неопределено, Таймаут = 0) Экспорт
	
	мПользоватль	= ?(Не ЗначениеЗаполнено(_Пользователь), "", _Пользователь);
	мПароль			= ?(Не ЗначениеЗаполнено(ПарольПользователя), "", ПарольПользователя);
	Соединение		= Неопределено;
	
	Попытка	
		WebService				= ?(Хост = Неопределено, "http://localhost/trade", Хост);	
		Определения				= Новый WSОпределения(WebService + "/ws/trade_exchange_service.1cws?wsdl", СокрЛП(мПользоватль), СокрЛП(мПароль),,Таймаут);
		Соединение 				= Новый WSПрокси(Определения, "http://192.168.10.9/trade/", "trade_exchange_service", "trade_exchange_serviceSoap",, Таймаут);
		Соединение.Пользователь	= СокрЛП(мПользоватль); 
		Соединение.Пароль		= СокрЛП(мПароль); 
	Исключение
		Соединение		= Неопределено;
		ОписаниеОшибки	= ОписаниеОшибки();
	КонецПопытки;

	Возврат Соединение;
	
КонецФункции

&НаСервере
Функция ping(Хост = Неопределено) Экспорт
	WebService				= ?(Хост = Неопределено, "http://localhost/trade", Хост);
	ОписаниеОшибки = "";
	Соединение = ПолучитьСоединениеTrade(WebService, , ОписаниеОшибки, 3);
	Если Соединение <> Неопределено ТОгда
		Результат = Соединение.ping();
	Иначе
		Результат = ОписаниеОшибки;	
	КонецЕсли;
	Возврат Результат;
КонецФункции
